In [23]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")

In [5]:
#Q1

In [3]:
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [4]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [12]:
df[['PassengerId', 'Survived', 'Pclass']]

     PassengerId  Survived  Pclass
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

[891 rows x 3 columns]

In [10]:
#Q2

In [150]:
import pandas as pd

def reindex_with_incrementing_index(df):
    new_index = pd.Index(range(1, len(df) * 2, 2), name='new_index')
    new_df = df.reset_index(drop=True)
    new_df.index = new_index
    return new_df

data = {'A': [10, 20, 30], 'B': [100, 200, 300], 'C': [1000, 2000, 3000]}
df = pd.DataFrame(data)

new_df = reindex_with_incrementing_index(df)
new_df

            A    B     C
new_index
1          10  100  1000
3          20  200  2000
5          30  300  3000

In [4]:
#Q3

In [28]:
Values = {'Values':[10,20,30,40,50]}

In [29]:
df1 = pd.DataFrame(Values)

In [30]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [31]:
df1['Values'][0:3].sum()

60

In [32]:
#Q4

In [72]:
import pandas as pd
Text = {'Text':['Giftson Paul','Paul Nadar 1 2 3','PW skills eng','Skills part2',"GG"]}

In [67]:
df2 = pd.DataFrame(Text)

In [68]:
df2

               Text
0      Giftson Paul
1  Paul Nadar 1 2 3
2     PW skills eng
3      Skills part2
4                GG

In [69]:
def GG(txt):
    return len(txt.split())

In [70]:
df2['Word_Count'] = df2['Text'].apply(GG)

In [71]:
df2

               Text  Word_Count
0      Giftson Paul           2
1  Paul Nadar 1 2 3           5
2     PW skills eng           3
3      Skills part2           2
4                GG           1

In [73]:
#Q5

In [79]:
"DataFrame.size() - Gives the total numbers of elements present inside the DataFrame"

'DataFrame.size() - Gives the total numbers of elements present inside the DataFrame'

In [81]:
"DataFrame.shape() - returns a tuple that contains two values: the number of rows and the number of columns in the DataFrame."

'DataFrame.shape() - returns a tuple that contains two values: the number of rows and the number of columns in the DataFrame.'

In [94]:
df2

               Text  Word_Count
0      Giftson Paul           2
1  Paul Nadar 1 2 3           5
2     PW skills eng           3
3      Skills part2           2
4                GG           1

In [95]:
df2.size

10

In [96]:
df2.shape

(5, 2)

In [97]:
#Q6

In [98]:
"read_excel() we use to read excel files using pandas"

'read_excel() we use to read excel files using pandas'

In [106]:
import pandas as pd
lusid = pd.read_excel('LUSID.xslx')
lusid

FileNotFoundError: [Errno 2] No such file or directory: 'LUSID.xslx'

In [104]:
players = pd.read_csv('NBA.csv')

In [105]:
players

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [107]:
#Q7

In [111]:
Email = {'Email':["gift123@domain.com","pw@example.com","john.doe@yahoo.com"]}

In [112]:
df4 = pd.DataFrame(Email)

In [113]:
df4

                Email
0  gift123@domain.com
1      pw@example.com
2  john.doe@yahoo.com

In [114]:
def username(emailid):
    uname = emailid.split('@')
    return uname[0]

In [115]:
df4['Username'] = df4['Email'].apply(username)

In [116]:
df4

                Email  Username
0  gift123@domain.com   gift123
1      pw@example.com        pw
2  john.doe@yahoo.com  john.doe

In [117]:
#Q8

In [123]:
data = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}

In [124]:
df5 = pd.DataFrame(data)

In [125]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [139]:
df5[(df5['A'] > 5) & (df5['B'] < 9)]

   A  B  C
1  8  2  7
4  9  1  2

In [141]:
df5[(df5['A'] > 5) & (df5['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [142]:
#Q9

In [151]:
data1 = {'Values':[10,100,1000,10000]}

In [152]:
df6 = pd.DataFrame(data1)

In [153]:
df6

   Values
0      10
1     100
2    1000
3   10000

In [203]:
import pandas as pd
import numpy as np
import statistics as st
def mmsd(val):
    mean = np.mean(val)
    mode = st.mode(val)
    standard_deviation = np.std(val)
    print(f"Mean: {mean}")
    print(f"Mode: {mode}")
    print(f"Standard Deviation: {standard_deviation}")

In [173]:
val = df6['Values']

In [174]:
mmsd(val)

Mean: 2777.5
Mode: 10
Standard Deviation: 4187.841777097125

In [177]:
#Q10

In [192]:
data = {'Date': pd.date_range('2023-08-01', periods=10),
        'Value': [10, 15, 13, 20, 18, 22, 25, 24, 28, 30]}
df = pd.DataFrame(data)

window_size = 8
df['MovingAverage'] = df['Value'].rolling(window=window_size).mean()

In [193]:
df

        Date  Value  MovingAverage
0 2023-08-01     10            NaN
1 2023-08-02     15            NaN
2 2023-08-03     13            NaN
3 2023-08-04     20            NaN
4 2023-08-05     18            NaN
5 2023-08-06     22            NaN
6 2023-08-07     25            NaN
7 2023-08-08     24         18.375
8 2023-08-09     28         20.625
9 2023-08-10     30         22.500

In [194]:
#Q11

In [218]:
data = {'Date':pd.date_range('01-01-2023',periods=5)}

In [219]:
df7 = pd.DataFrame(data)

In [220]:
df7

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [222]:
days = {0 : 'Monday', 1:'Tuesday', 2:'Wednesday', 3:'Thursday', 4:'Friday', 5:'Saturday', 6:'Sunday'}

In [229]:
def weekdays(date):
    wday = date.weekday()
    for i in days:
        if i == wday:
            return(days[i])

In [230]:
df7['Weekday'] = df7['Date'].apply(weekdays)

In [231]:
df7

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [232]:
#Q12

In [248]:
from datetime import date
data = {'Date':pd.date_range('2022-12-25',periods=15)}

In [240]:
df8 = pd.DataFrame(data)

In [241]:
df8

         Date
0  2022-12-25
1  2022-12-26
2  2022-12-27
3  2022-12-28
4  2022-12-29
5  2022-12-30
6  2022-12-31
7  2023-01-01
8  2023-01-02
9  2023-01-03
10 2023-01-04
11 2023-01-05
12 2023-01-06
13 2023-01-07
14 2023-01-08

In [245]:
df8[(df8['Date'] >= '2023-01-01') & (df8['Date'] <= '2023-01-31')]

         Date
7  2023-01-01
8  2023-01-02
9  2023-01-03
10 2023-01-04
11 2023-01-05
12 2023-01-06
13 2023-01-07
14 2023-01-08

In [246]:
#Q13

In [247]:
"To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas library"

'To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas library'

In [ ]:
import pandas as pd